In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

In [2]:
#create path
path = r'C:\Users\hnguy\OneDrive\Documents\Instacart Basket Analysis'

In [3]:
#import customer data
df_customer = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
#rename columns with illogical names
df_customer.rename(columns = {'First Name':'first_name'}, inplace=True)

In [6]:
df_customer.rename(columns = {'Surnam':'last_name'}, inplace=True)

In [7]:
df_customer.rename(columns = {'Gender':'gender'}, inplace=True)

In [8]:
df_customer.rename(columns = {'STATE':'state'}, inplace=True)

In [9]:
df_customer.rename(columns = {'Age':'age'}, inplace=True)

In [10]:
df_customer.rename(columns = {'n_dependants':'no_dependants'}, inplace=True)

In [11]:
df_customer.rename(columns = {'fam_status':'marital status'}, inplace=True)

In [12]:
df_customer.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_dependants,marital status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
#check for duplicates
df_customer[df_customer.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, no_dependants, marital status, income]
Index: []

In [14]:
#check for missing values
df_customer.isnull().sum()

user_id               0
first_name        11259
last_name             0
gender                0
state                 0
age                   0
date_joined           0
no_dependants         0
marital status        0
income                0
dtype: int64

In [15]:
#create dataframe of only missing values
df_nan = df_customer[df_customer['first_name'].isnull() == True]

In [16]:
df_nan

,user_id,first_name,last_name,gender,state,age,date_joined,no_dependants,marital status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [18]:
#check for mixed-type data
for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

first_name

In [19]:
#check data type of "first name"
df_customer['first_name'].dtype

dtype('O')

In [20]:
#change data type to str
df_customer['first_name'] = df_customer['first_name'].astype('str')

In [24]:
#import last updated data of orders and products
df_ords_prods_merged =  pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_updated.pkl'))

In [25]:
#merge that data with new customer data
df_merged = df_ords_prods_merged.merge(df_customer, on = 'user_id')

In [27]:
#export dataframe
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'df_merged_final.pkl'))